In [1]:
import csv, sqlite3

con = sqlite3.connect("RealWorldData.db")
cur = con.cursor()

In [265]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql sqlite:///RealWorldData.db

In [13]:
import pandas as pd

df = pd.read_csv("ChicagoPublicSchools.csv")

df.to_sql("CHICAGO_PUBLIC_SCHOOLS_DATA", con, if_exists = 'replace', index = False, method = "multi")

566

In [19]:
%sql SELECT name from sqlite_master WHERE TYPE = 'table';

 * sqlite:///RealWorldData.db
Done.

[('CHICAGO_PUBLIC_SCHOOLS_DATA',)]

In [109]:
%%sql SELECT name,type, length(type) FROM PRAGMA_TABLE_INFO('CHICAGO_PUBLIC_SCHOOLS_DATA') 
where lower(name) LIKE '%enrol%' OR lower(name) LIKE '%area%';

 * sqlite:///RealWorldData.db
Done.

[('College_Enrollment_Rate__', 'TEXT', 4),
 ('COLLEGE_ENROLLMENT', 'INTEGER', 7),
 ('COMMUNITY_AREA_NUMBER', 'INTEGER', 7),
 ('COMMUNITY_AREA_NAME', 'TEXT', 4)]

In [67]:
%%sql SELECT COUNT(*) FROM CHICAGO_PUBLIC_SCHOOLS_DATA
WHERE "Elementary, Middle, or High School" = "ES";

 * sqlite:///RealWorldData.db
Done.

[(462,)]

In [77]:
#HIGHEST SAFETY SCORE
%sql SELECT SELECT max(SAFETY_SCORE) FROM CHICAGO_PUBLIC_SCHOOLS_DATA;

 * sqlite:///RealWorldData.db
Done.

[(99.0,)]

In [83]:
%%sql SELECT NAME_OF_SCHOOL FROM CHICAGO_PUBLIC_SCHOOLS_DATA 
WHERE SAFETY_SCORE = (SELECT max(SAFETY_SCORE) FROM CHICAGO_PUBLIC_SCHOOLS_DATA);

 * sqlite:///RealWorldData.db
Done.

[('Abraham Lincoln Elementary School',),
 ('Alexander Graham Bell Elementary School',),
 ('Annie Keller Elementary Gifted Magnet School',),
 ('Augustus H Burley Elementary School',),
 ('Edgar Allan Poe Elementary Classical School',),
 ('Edgebrook Elementary School',),
 ('Ellen Mitchell Elementary School',),
 ('James E McDade Elementary Classical School',),
 ('James G Blaine Elementary School',),
 ('LaSalle Elementary Language Academy',),
 ('Mary E Courtenay Elementary Language Arts Center',),
 ('Northside College Preparatory High School',),
 ('Northside Learning Center High School',),
 ('Norwood Park Elementary School',),
 ('Oriole Park Elementary School',),
 ('Sauganash Elementary School',),
 ('Stephen Decatur Classical Elementary School',),
 ('Talman Elementary School',),
 ('Wildwood Elementary School',)]

In [89]:
%%sql SELECT NAME_OF_SCHOOL, AVERAGE_STUDENT_ATTENDANCE FROM CHICAGO_PUBLIC_SCHOOLS_DATA 
GROUP BY 2
ORDER BY 2 DESC
LIMIT 10;

 * sqlite:///RealWorldData.db
Done.

[('John Charles Haines Elementary School', '98.40%'),
 ('James Ward Elementary School', '97.80%'),
 ('Edgar Allan Poe Elementary Classical School', '97.60%'),
 ('Annie Keller Elementary Gifted Magnet School', '97.50%'),
 ('Andrew Jackson Elementary Language Academy', '97.40%'),
 ('Disney II Magnet School', '97.30%'),
 ('John H Vanderpoel Elementary Magnet School', '97.20%'),
 ('Mark Skinner Elementary School', '97.10%'),
 ('Albany Park Multicultural Academy', '97.00%'),
 ('Ambrose Plamondon Elementary School', '96.90%')]

In [91]:
%%sql SELECT NAME_OF_SCHOOL, AVERAGE_STUDENT_ATTENDANCE FROM CHICAGO_PUBLIC_SCHOOLS_DATA 
GROUP BY 2
ORDER BY 2 ASC
LIMIT 5;

 * sqlite:///RealWorldData.db
Done.

[('Velma F Thomas Early Childhood Center', None),
 ('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%')]

In [97]:
%%sql SELECT NAME_OF_SCHOOL, REPLACE(AVERAGE_STUDENT_ATTENDANCE, '%', '') AS AVG_SCHOOL_ATTENDANCE
FROM CHICAGO_PUBLIC_SCHOOLS_DATA 
GROUP BY 2
ORDER BY 2 ASC
LIMIT 5;

 * sqlite:///RealWorldData.db
Done.

[('Velma F Thomas Early Childhood Center', None),
 ('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00')]

In [101]:
%%sql SELECT NAME_OF_SCHOOL, REPLACE(AVERAGE_STUDENT_ATTENDANCE, '%', '') AS AVG_SCHOOL_ATTENDANCE
FROM CHICAGO_PUBLIC_SCHOOLS_DATA 
WHERE CAST(REPLACE(AVERAGE_STUDENT_ATTENDANCE, '%', '') AS INT) < 70
GROUP BY 2
ORDER BY 2 ASC;

 * sqlite:///RealWorldData.db
Done.

[('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00'),
 ('Orr Academy High School', '66.30'),
 ('Manley Career Academy High School', '66.80'),
 ('Chicago Vocational Career Academy High School', '68.80'),
 ('Roberto Clemente Community Academy High School', '69.60')]

In [267]:
#TOTAL COLLEGE ENROLLMENT PER COMMUNITY

%%sql select Community_Area_Name, sum(College_Enrollment) AS TOTAL_ENROLLMENT \
from CHICAGO_PUBLIC_SCHOOLS_DATA \
group by Community_Area_Name \
ORDER BY TOTAL_ENROLLMENT;

UsageError: Line magic function `%%sql` not found.

In [229]:
%%sql SELECT name,type, length(type) FROM PRAGMA_TABLE_INFO('CHICAGO_PUBLIC_SCHOOLS_DATA') 
where lower(name) LIKE 'i%';

 * sqlite:///RealWorldData.db
Done.

[('Instruction_Icon', 'TEXT', 4),
 ('Instruction_Score', 'REAL', 4),
 ('Individualized_Education_Program_Compliance_Rate', 'TEXT', 4),
 ('ISAT_Exceeding_Math__', 'REAL', 4),
 ('ISAT_Exceeding_Reading__', 'REAL', 4),
 ('ISAT_Value_Add_Math', 'REAL', 4),
 ('ISAT_Value_Add_Read', 'REAL', 4),
 ('ISAT_Value_Add_Color_Math', 'TEXT', 4),
 ('ISAT_Value_Add_Color_Read', 'TEXT', 4)]

In [119]:
%%sql SELECT SUM(COLLEGE_ENROLLMENT), COMMUNITY_AREA_NAME
FROM CHICAGO_PUBLIC_SCHOOLS_DATA
GROUP BY 2
ORDER BY 1 ASC
LIMIT 5;

 * sqlite:///RealWorldData.db
Done.

[(140, 'OAKLAND'),
 (531, 'FULLER PARK'),
 (549, 'BURNSIDE'),
 (786, 'OHARE'),
 (871, 'LOOP')]

In [127]:
%%sql SELECT NAME_OF_SCHOOL, SAFETY_SCORE 
FROM CHICAGO_PUBLIC_SCHOOLS_DATA
WHERE SAFETY_SCORE != 'None'
ORDER BY 2 ASC
LIMIT 5;

 * sqlite:///RealWorldData.db
Done.

[('Edmond Burke Elementary School', 1.0),
 ("Luke O'Toole Elementary School", 5.0),
 ('George W Tilton Elementary School', 6.0),
 ('Foster Park Elementary School', 11.0),
 ('Emil G Hirsch Metropolitan High School', 13.0)]

get school with college enrollment = 4368
get community area of school
get hardship index of community area

In [154]:
dg = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCensusData.csv")
dg.to_sql("CHICAGO_CENSUS_DATA", con, if_exists = 'replace', index = False, method = "multi")

78

In [187]:
%sql SELECT name,type, length(type) from PRAGMA_TABLE_INFO('CHICAGO_CENSUS_DATA');

 * sqlite:///RealWorldData.db
Done.

[('COMMUNITY_AREA_NUMBER', 'REAL', 4),
 ('COMMUNITY_AREA_NAME', 'TEXT', 4),
 ('PERCENT_OF_HOUSING_CROWDED', 'REAL', 4),
 ('PERCENT_HOUSEHOLDS_BELOW_POVERTY', 'REAL', 4),
 ('PERCENT_AGED_16__UNEMPLOYED', 'REAL', 4),
 ('PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA', 'REAL', 4),
 ('PERCENT_AGED_UNDER_18_OR_OVER_64', 'REAL', 4),
 ('PER_CAPITA_INCOME', 'INTEGER', 7),
 ('HARDSHIP_INDEX', 'REAL', 4)]

In [183]:
%%sql SELECT cp.NAME_OF_SCHOOL, cp.COLLEGE_ENROLLMENT, cp.COMMUNITY_AREA_NAME, cc.HARDSHIP_INDEX
FROM CHICAGO_PUBLIC_SCHOOLS_DATA cp, CHICAGO_CENSUS_DATA cc
WHERE cp.COMMUNITY_AREA_NUMBER = cc.COMMUNITY_AREA_NUMBER AND cp.COLLEGE_ENROLLMENT = 4368;

 * sqlite:///RealWorldData.db
Done.

[('Albert G Lane Technical High School', 4368, 'NORTH CENTER', 6.0)]

In [209]:
%%sql SELECT cc.HARDSHIP_INDEX, cp.COLLEGE_ENROLLMENT, cp.COMMUNITY_AREA_NAME,
FROM CHICAGO_PUBLIC_SCHOOLS_DATA cp, CHICAGO_CENSUS_DATA cc
WHERE cp.COMMUNITY_AREA_NUMBER = cc.COMMUNITY_AREA_NUMBER 
AND cp.COLLEGE_ENROLLMENT = (SELECT MIN(COLLEGE_ENROLLMENT) from CHICAGO_PUBLIC_SCHOOLS_DATA);

 * sqlite:///RealWorldData.db
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: SELECT cc.HARDSHIP_INDEX, cp.COLLEGE_ENROLLMENT, cp.COMMUNITY_AREA_NAME,
FROM CHICAGO_PUBLIC_SCHOOLS_DATA cp, CHICAGO_CENSUS_DATA cc
WHERE cp.COMMUNITY_AREA_NUMBER = cc.COMMUNITY_AREA_NUMBER
AND cp.COLLEGE_ENROLLMENT = (SELECT MIN(COLLEGE_ENROLLMENT) from CHICAGO_PUBLIC_SCHOOLS_DATA);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [219]:
%%sql SELECT cp.COMMUNITY_AREA_NAME, MAX(cp.COLLEGE_ENROLLMENT), cc.HARDSHIP_INDEX
FROM CHICAGO_PUBLIC_SCHOOLS_DATA cp, CHICAGO_CENSUS_DATA cc
WHERE cp.COMMUNITY_AREA_NUMBER = cc.COMMUNITY_AREA_NUMBER

 * sqlite:///RealWorldData.db
Done.

[('NORTH CENTER', 4368, 6.0)]

In [215]:
%%sql select community_area_number, community_area_name, hardship_index from CHICAGO_CENSUS_DATA 
   where community_area_number in 
   ( select community_area_number from CHICAGO_PUBLIC_SCHOOLS_DATA order by college_enrollment desc limit 1 )

 * sqlite:///RealWorldData.db
Done.

[(5.0, 'North Center', 6.0)]

In [291]:
%%sql select Community_Area_Name, sum(College_Enrollment) AS TOTAL_ENROLLMENT 
from CHICAGO_PUBLIC_SCHOOLS_DATA 
group by Community_Area_Name
ORDER BY 2 DESC
LIMIT 1;

 * sqlite:///RealWorldData.db
Done.

[('SOUTH LAWNDALE', 14793)]

In [297]:
%%sql SELECT COMMUNITY_AREA_NAME, HARDSHIP_INDEX 
from CHICAGO_CENSUS_DATA
WHERE COMMUNITY_AREA_NAME = 'South Lawndale';

 * sqlite:///RealWorldData.db
Done.

[('South Lawndale', 96.0)]